### Data Load and View

In [ ]:
import pandas as pd

df_train = pd.read_csv('pendapatan_train.csv')
df_test = pd.read_csv('pendapatan_test.csv')
df_full = [df_train, df_test]

In [ ]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28794 entries, 0 to 28793
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     28794 non-null  int64
 1   Umur                   28794 non-null  int64
 2   Kelas Pekerja          28794 non-null  object
 3   Berat Akhir            28794 non-null  int64
 4   Pendidikan             28794 non-null  object
 5   Jmlh Tahun Pendidikan  28794 non-null  int64
 6   Status Perkawinan      28794 non-null  object
 7   Pekerjaan              28794 non-null  object
 8   Jenis Kelamin          28794 non-null  object
 9   Keuntungan Kapital     28794 non-null  float64
 10  Kerugian Capital       28794 non-null  float64
 11  Jam per Minggu         28794 non-null  float64
 12  Gaji                   28794 non-null  object
dtypes: float64(3), int64(4), object(6)
memory usage: 2.9+ MB

In [ ]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9599 entries, 0 to 9598
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     9599 non-null   int64
 1   Umur                   9599 non-null   int64
 2   Kelas Pekerja          9599 non-null   object
 3   Berat Akhir            9599 non-null   int64
 4   Pendidikan             9599 non-null   object
 5   Jmlh Tahun Pendidikan  9599 non-null   int64
 6   Status Perkawinan      9599 non-null   object
 7   Pekerjaan              9599 non-null   object
 8   Jenis Kelamin          9599 non-null   object
 9   Keuntungan Kapital     9599 non-null   float64
 10  Kerugian Capital       9599 non-null   float64
 11  Jam per Minggu         9599 non-null   float64
dtypes: float64(3), int64(4), object(5)
memory usage: 900.0+ KB

### Data Exploration

In [ ]:
df_train['Gaji'].value_counts()

<=7jt    21973
>7jt      6821
Name: Gaji, dtype: int64

In [ ]:
df_train[['Kerugian Capital', 'Keuntungan Kapital', 'Gaji']].groupby(['Gaji'], as_index=False).mean()

    Gaji  Kerugian Capital  Keuntungan Kapital
0  <=7jt      7.667569e+05        2.117977e+06
1   >7jt      2.684295e+06        5.851150e+07

In [ ]:
gaji = {'<=7jt' : 0, '>7jt' : 1}
df_train['Gaji'].replace(gaji, inplace=True)

In [ ]:
for dataset in df_full:
  dataset['Pekerjaan'].replace('?', 'Lainnya', inplace=True)
  dataset['Kelas Pekerja'].replace('?', 'Lainnya', inplace=True)
  dataset['Gender'] = dataset['Jenis Kelamin'].map({'Perempuan' : 0, 'Laki2': 1})

In [ ]:
df_test.tail()

         id  Umur Kelas Pekerja  ...  Kerugian Capital Jam per Minggu  Gender
9594  38388    54    Wiraswasta  ...               0.0           40.0       1
9595  38389    33    Wiraswasta  ...               0.0           55.0       1
9596  38390    24    Wiraswasta  ...               0.0           45.0       1
9597  38391    34    Wiraswasta  ...               0.0           40.0       0
9598  38392    63    Wiraswasta  ...               0.0           40.0       1

[5 rows x 13 columns]

In [ ]:
for dataset in df_full:
  dataset['Kelas Pekerja'] = dataset['Kelas Pekerja'].astype('category')
  dataset['Pendidikan'] = dataset['Pendidikan'].astype('category')
  dataset['Status Perkawinan'] = dataset['Status Perkawinan'].astype('category')
  dataset['Pekerjaan'] = dataset['Pekerjaan'].astype('category')
  dataset['Jmlh Tahun Pendidikan'] = dataset['Jmlh Tahun Pendidikan'].astype('category')

  dataset['Kelas Pekerja'] = dataset['Kelas Pekerja'].cat.codes
  dataset['Pendidikan'] = dataset['Pendidikan'].cat.codes
  dataset['Status Perkawinan'] = dataset['Status Perkawinan'].cat.codes
  dataset['Pekerjaan'] = dataset['Pekerjaan'].cat.codes
  dataset['Jmlh Tahun Pendidikan'] = dataset['Jmlh Tahun Pendidikan'].cat.codes

In [ ]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28794 entries, 0 to 28793
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     28794 non-null  int64
 1   Umur                   28794 non-null  int64
 2   Kelas Pekerja          28794 non-null  int8
 3   Berat Akhir            28794 non-null  int64
 4   Pendidikan             28794 non-null  int8
 5   Jmlh Tahun Pendidikan  28794 non-null  int8
 6   Status Perkawinan      28794 non-null  int8
 7   Pekerjaan              28794 non-null  int8
 8   Jenis Kelamin          28794 non-null  object
 9   Keuntungan Kapital     28794 non-null  float64
 10  Kerugian Capital       28794 non-null  float64
 11  Jam per Minggu         28794 non-null  float64
 12  Gaji                   28794 non-null  int64
 13  Gender                 28794 non-null  int64
dtypes: float64(3), int64(5), int8(5), object(1)
memory usage: 2.1+ MB

In [ ]:
from sklearn.preprocessing import MinMaxScaler
import numpy as np
minmax = MinMaxScaler()
for ds in df_full:
  ds['Keuntungan'] = minmax.fit_transform(ds['Keuntungan Kapital'][:, np.newaxis])
  ds['Kerugian'] = minmax.fit_transform(ds['Kerugian Capital'][:, np.newaxis])

In [ ]:
for ds in df_full:
  ds['Usia'] = pd.cut(ds['Umur'], 3).astype('category')
  ds['Jam Kerja'] = pd.cut(ds['Jam per Minggu'], 3).astype('category')
  ds['Akumulasi Berat'] = pd.cut(ds['Berat Akhir'], 3).astype('category')
  ds['Usia'] = ds['Usia'].cat.codes
  ds['Jam Kerja'] = ds['Jam Kerja'].cat.codes
  ds['Akumulasi Berat'] = ds['Akumulasi Berat'].cat.codes

In [ ]:
col_names = ['id', 'Umur', 'Berat Akhir', 'Jenis Kelamin', 'Keuntungan Kapital', 'Kerugian Capital', 'Jam per Minggu']
df_train = df_train.drop(columns=col_names)
df_test = df_test.drop(columns=col_names)

In [ ]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28794 entries, 0 to 28793
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Kelas Pekerja          28794 non-null  int8
 1   Pendidikan             28794 non-null  int8
 2   Jmlh Tahun Pendidikan  28794 non-null  int8
 3   Status Perkawinan      28794 non-null  int8
 4   Pekerjaan              28794 non-null  int8
 5   Gaji                   28794 non-null  int64
 6   Gender                 28794 non-null  int64
 7   Keuntungan             28794 non-null  float64
 8   Kerugian               28794 non-null  float64
 9   Usia                   28794 non-null  int8
 10  Jam Kerja              28794 non-null  int8
 11  Akumulasi Berat        28794 non-null  int8
dtypes: float64(2), int64(2), int8(8)
memory usage: 1.1 MB

In [ ]:
df_test

      Kelas Pekerja  Pendidikan  ...  Jam Kerja  Akumulasi Berat
0                 5          13  ...          1                0
1                 8          13  ...          1                0
2                 8          13  ...          1                0
3                 8          13  ...          1                1
4                 8          13  ...          0                0
...             ...         ...  ...        ...              ...
9594              8          11  ...          1                0
9595              8          14  ...          1                0
9596              8          13  ...          1                0
9597              8          13  ...          1                0
9598              8          13  ...          1                0

[9599 rows x 9 columns]

### Modelling and Train

In [ ]:
#trial 2
df_train = df_train.drop(columns=['Keuntungan', 'Kerugian', 'Akumulasi Berat'])
df_test = df_test.drop(columns=['Keuntungan', 'Kerugian', 'Akumulasi Berat'])

In [ ]:
#trial 3
df_train = df_train.drop(columns=['Keuntungan', 'Kerugian', 'Akumulasi Berat', 'Jmlh Tahun Pendidikan'])
df_test = df_test.drop(columns=['Keuntungan', 'Kerugian', 'Akumulasi Berat', 'Jmlh Tahun Pendidikan'])

In [ ]:
X_test = df_test
X_train = df_train.drop(columns=['Gaji'])
y_train = df_train['Gaji']

In [ ]:
from sklearn.model_selection import GridSearchCV
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier()
param_grid = {'n_neighbors':np.arange(5,21), 'weights':['uniform', 'distance']}
gscv = GridSearchCV(knn, param_grid=param_grid, cv=5, scoring='roc_auc')

gscv.fit(X_train, y_train)

GridSearchCV(cv=5, error_score=nan,
             estimator=KNeighborsClassifier(algorithm='auto', leaf_size=30,
                                            metric='minkowski',
                                            metric_params=None, n_jobs=None,
                                            n_neighbors=5, p=2,
                                            weights='uniform'),
             iid='deprecated', n_jobs=None,
             param_grid={'n_neighbors': array([ 5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]),
                         'weights': ['uniform', 'distance']},
             pre_dispatch='2*n_jobs', refit=True, return_train_score=False,
             scoring='roc_auc', verbose=0)

In [ ]:
gscv.best_score_

0.8592288661782286

In [ ]:
gscv.best_params_

{'multi_class': 'auto', 'penalty': 'l2', 'solver': 'liblinear'}

In [ ]:
model_lr = LogisticRegression(multi_class='auto', penalty='l2', solver='liblinear').fit(X_train, y_train)
y_predict = model_lr.predict(X_test)

In [ ]:
np.unique(y_predict,return_counts=True)

(array([0, 1]), array([8001, 1598]))

### Submission

In [ ]:
df_test2 = pd.read_csv('pendapatan_test.csv')
df_test2

         id  Umur  ... Kerugian Capital  Jam per Minggu
0     28794    31  ...              0.0            40.0
1     28795    34  ...              0.0            40.0
2     28796    58  ...              0.0            60.0
3     28797    49  ...              0.0            43.0
4     28798    60  ...              0.0            20.0
...     ...   ...  ...              ...             ...
9594  38388    54  ...              0.0            40.0
9595  38389    33  ...              0.0            55.0
9596  38390    24  ...              0.0            45.0
9597  38391    34  ...              0.0            40.0
9598  38392    63  ...              0.0            40.0

[9599 rows x 12 columns]

In [ ]:
submission = pd.DataFrame(df_test2['id'])
submission['Gaji'] = y_predict
submission

         id  Gaji
0     28794     0
1     28795     0
2     28796     0
3     28797     0
4     28798     0
...     ...   ...
9594  38388     0
9595  38389     1
9596  38390     0
9597  38391     0
9598  38392     0

[9599 rows x 2 columns]

In [ ]:
submission['Gaji'].value_counts()

0    8001
1    1598
Name: Gaji, dtype: int64

In [ ]:
submission.to_csv('subFinalProject4.csv', index=False)